package cook.cook;

import gr.hua.dit.oop2.countdown.Notifier;

//Διεπαφή που αναπαριστά έναν χρονοδιακόπτη αντίστροφης μέτρησης
public interface Countdown {
    void start(); //Ξεκινά τον χρονοδιακόπτη αντίστροφης μέτρησης.
    void stop();//Διακόπτει τον χρονοδιακόπτη αντίστροφης μέτρησης.
    long secondsRemaining();//Επιστρέφει τον αριθμό των δευτερολέπτων που απομένουν στον χρονοδιακόπτη.
    void addNotifier(Notifier notifier);//Προσθέτει έναν ειδοποιητή που θα ενεργοποιηθεί όταν ο χρονοδιακόπτης ολοκληρωθεί.
    String getName();//Επιστρέφει το όνομα του χρονοδιακόπτη, αν υπάρχει.
    
}
